CompleterVille/bpelContent/CompleterVilleArtifacts.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<definitions xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://completerVille" xmlns:vprop="http://docs.oasis-open.org/wsbpel/2.0/varprop" xmlns:wsdl="http://www.oorsprong.org/websamples.countryinfo" name="CompleterVille" targetNamespace="http://completerVille">

<!-- ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
     TYPE DEFINITION - List of types participating in this BPEL process 
     The BPEL Designer will generate default request and response types
     but you can define or import any XML Schema type and use them as part 
     of the message types.
     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ -->    
    <plnk:partnerLinkType name="CountryISOCode">
    <plnk:role name="CountryISOCode" portType="wsdl:CountryInfoServiceSoapType"/>
  </plnk:partnerLinkType>
    <plnk:partnerLinkType name="CountryInfo">
    <plnk:role name="CoutnryInfo" portType="wsdl:CountryInfoServiceSoapType"/>
  </plnk:partnerLinkType>
    <plnk:partnerLinkType name="CountryInfoPL">
    <plnk:role name="CountryInfoPL" portType="wsdl:CountryInfoServiceSoapType"/>
  </plnk:partnerLinkType>
    <import location="CountryInfo.wsdl" namespace="http://www.oorsprong.org/websamples.countryinfo"/>
    <types>
        <schema xmlns="http://www.w3.org/2001/XMLSchema" attributeFormDefault="unqualified" elementFormDefault="qualified" targetNamespace="http://completerVille">

            <element name="CompleterVilleRequest">
                <complexType>
                    <sequence>

                    	<element name="CountryName" type="string"/>
                    </sequence>
                </complexType>
            </element>

            <element name="CompleterVilleResponse">
                <complexType>
                    <sequence>
                        <element name="result" type="string"/>
                    </sequence>
                </complexType>
            </element>
        </schema>
    </types>


<!-- ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
     MESSAGE TYPE DEFINITION - Definition of the message types used as 
     part of the port type defintions
     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ -->    
    <message name="CompleterVilleRequestMessage">
        <part element="tns:CompleterVilleRequest" name="payload"/>
    </message>
    <message name="CompleterVilleResponseMessage">
        <part element="tns:CompleterVilleResponse" name="payload"/>
    </message>

<!-- ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
     PORT TYPE DEFINITION - A port type groups a set of operations into
     a logical service unit.
     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ -->    

    <!-- portType implemented by the CompleterVille BPEL process -->
    <portType name="CompleterVille">
        <operation name="process">
            <input message="tns:CompleterVilleRequestMessage"/>
            <output message="tns:CompleterVilleResponseMessage"/>
        </operation>
    </portType>   
<!-- ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
     PARTNER LINK TYPE DEFINITION
     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ -->    
    <plnk:partnerLinkType name="CompleterVille">
        <plnk:role name="CompleterVilleProvider" portType="tns:CompleterVille"/>
    </plnk:partnerLinkType>
    

<!-- ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
     BINDING DEFINITION - Defines the message format and protocol details
     for a web service.
     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ -->
    <binding name="CompleterVilleBinding" type="tns:CompleterVille">
    	<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    	<operation name="process">
    		<soap:operation soapAction="http://completerVille/process"/>
    		<input>
    			<soap:body use="literal"/>
    		</input>
    		<output>
    			<soap:body use="literal"/>
    		</output>
    	</operation>
    </binding>

<!-- ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
     SERVICE DEFINITION - A service groups a set of ports into
     a service unit.
     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ -->
    <service name="CompleterVilleService">
    	<port binding="tns:CompleterVilleBinding" name="CompleterVillePort">
    		<soap:address location="http://localhost:8080/ode/processes/CompleterVille"/>
    	</port>
    </service>
</definitions>
